# ComboBox Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBox Methods
ComboBox Class See Also
---
The ComboBox type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddItem | Adds a new item to the ComboBox. |
| AddItems | Adds a new items to the ComboBox. |
| AddSeparator | Adds a separator to the drop-down list. |
| Equals | Determines whether the specified Object is equal to the current Object.  (Inherited from RibbonItem.) |
| GetContextualHelp | Gets the contextual help bound with this control. (Inherited from RibbonItem.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetItems | Gets the copy of a collection of the ComboBoxMembers assigned to the ComboBox. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetContextualHelp | Sets the contextual help bound with this button. (Inherited from RibbonItem.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ComboBox Class
Autodesk.Revit.UI Namespace